In [1]:
import numpy as np 

import pandas as pd

In [2]:
#creating a series (one-d array holding any type data)
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
#returning the series
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
#creating DataFrame - passing Numpy array with a datetime index, using data_range() and labeled columns 

dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
#Making datetime matrix 6 rows, 4 columns
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01  0.380902 -0.441350 -1.086454 -1.205264
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-03  2.245954 -0.389586 -0.199774  0.476287
2013-01-04 -0.098677 -1.407196 -1.148161  0.568213
2013-01-05  0.041963  0.135876  0.896228 -1.775263
2013-01-06  0.315203 -1.838507 -0.187225  0.436292

In [8]:
#creating a dataframe, passing a dictionary of objects where keys are the column lables and values are the column values 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test","train","test","train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
#columns of DF above have different dtypes

df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df2.<TAB> #tab is the action being done and can pull up the different functions

SyntaxError: invalid syntax (876754528.py, line 1)

In [13]:
df.head() #prints first 5 rows

                   A         B         C         D
2013-01-01  0.380902 -0.441350 -1.086454 -1.205264
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-03  2.245954 -0.389586 -0.199774  0.476287
2013-01-04 -0.098677 -1.407196 -1.148161  0.568213
2013-01-05  0.041963  0.135876  0.896228 -1.775263

In [15]:
df.tail(3) #prints last five or indicate the amount printes, ie:3

                   A         B         C         D
2013-01-04 -0.098677 -1.407196 -1.148161  0.568213
2013-01-05  0.041963  0.135876  0.896228 -1.775263
2013-01-06  0.315203 -1.838507 -0.187225  0.436292

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
#representation of the data without column or index labels 
df.to_numpy()

array([[ 0.38090173, -0.44134987, -1.08645396, -1.20526424],
       [-0.41729912,  0.09562117,  0.45641159,  0.28285288],
       [ 2.24595374, -0.38958623, -0.19977408,  0.47628652],
       [-0.09867695, -1.40719577, -1.1481611 ,  0.56821316],
       [ 0.0419626 ,  0.13587607,  0.89622807, -1.77526271],
       [ 0.31520251, -1.83850708, -0.18722505,  0.43629223]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.411341 -0.640857 -0.211496 -0.202814
std    0.944370  0.808739  0.814466  1.017594
min   -0.417299 -1.838507 -1.148161 -1.775263
25%   -0.063517 -1.165734 -0.864784 -0.833235
50%    0.178583 -0.415468 -0.193500  0.359573
75%    0.364477 -0.025681  0.295502  0.466288
max    2.245954  0.135876  0.896228  0.568213

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.380902   -0.417299    2.245954   -0.098677    0.041963    0.315203
B   -0.441350    0.095621   -0.389586   -1.407196    0.135876   -1.838507
C   -1.086454    0.456412   -0.199774   -1.148161    0.896228   -0.187225
D   -1.205264    0.282853    0.476287    0.568213   -1.775263    0.436292

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.205264 -1.086454 -0.441350  0.380902
2013-01-02  0.282853  0.456412  0.095621 -0.417299
2013-01-03  0.476287 -0.199774 -0.389586  2.245954
2013-01-04  0.568213 -1.148161 -1.407196 -0.098677
2013-01-05 -1.775263  0.896228  0.135876  0.041963
2013-01-06  0.436292 -0.187225 -1.838507  0.315203

In [23]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.315203 -1.838507 -0.187225  0.436292
2013-01-04 -0.098677 -1.407196 -1.148161  0.568213
2013-01-01  0.380902 -0.441350 -1.086454 -1.205264
2013-01-03  2.245954 -0.389586 -0.199774  0.476287
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-05  0.041963  0.135876  0.896228 -1.775263

In [24]:
df["A"]

2013-01-01    0.380902
2013-01-02   -0.417299
2013-01-03    2.245954
2013-01-04   -0.098677
2013-01-05    0.041963
2013-01-06    0.315203
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01  0.380902 -0.441350 -1.086454 -1.205264
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-03  2.245954 -0.389586 -0.199774  0.476287

In [26]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-03  2.245954 -0.389586 -0.199774  0.476287
2013-01-04 -0.098677 -1.407196 -1.148161  0.568213

In [27]:
df.loc[dates[0]]

A    0.380902
B   -0.441350
C   -1.086454
D   -1.205264
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.417299  0.095621
2013-01-03  2.245954 -0.389586
2013-01-04 -0.098677 -1.407196

In [29]:
df.loc[dates[0], "A"]

0.3809017263719718

In [30]:
df.at[dates[0], "A"]

0.3809017263719718

In [31]:
df.iloc[3]

A   -0.098677
B   -1.407196
C   -1.148161
D    0.568213
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.098677 -1.407196
2013-01-05  0.041963  0.135876

In [33]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.417299  0.456412
2013-01-03  2.245954 -0.199774
2013-01-05  0.041963  0.896228

In [34]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.417299  0.095621  0.456412  0.282853
2013-01-03  2.245954 -0.389586 -0.199774  0.476287

In [35]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.441350 -1.086454
2013-01-02  0.095621  0.456412
2013-01-03 -0.389586 -0.199774
2013-01-04 -1.407196 -1.148161
2013-01-05  0.135876  0.896228
2013-01-06 -1.838507 -0.187225

In [36]:
df.iloc[1, 1]

0.09562117421777946

In [37]:
df.iat[1, 1]

0.09562117421777946